---------------------הכנסת משתמשים---------------------------
INSERT INTO Users (Name, Email, Password)
VALUES 
('יהודית', 'yehudit.shoval@gmail.com', 'AAAaaa111'),
('תמר', 'tamars0583210294@gmail.com', 'Password123!'),
('נאוה', 'navash1818@gmail.com', 'SecureP@ss2025'),
('אלאסף', 'elasafshoval@gmail.com', 'MySuperSecure123!'),
('אלקנה', 'e0504127688@gmail.com', 'P@ssw0rd2024'),
('ידידיה', 'a0556789833@gmail.com', 'P@ssw0rd2024'),
('הודיה', 'h0556792025@gmail.com', 'P@ssw0rd2067'),
('בת שבע', 'bsadan95@gmail.com', 'P@ssw0rd4467'),
('אליעזר', 'eliezer@gmail.com', 'asdASD123');
------------------הכנסת סוגי אולמות-------------------------

INSERT INTO Hole (numOfLine, numOfSeatLine)
VALUES 
(10, 20),  -- אולם עם 10 שורות ו-20 מושבים בכל שורה
(2, 5),  -- אולם עם 15 שורות ו-25 מושבים בכל שורה
(12, 18),  -- אולם עם 12 שורות ו-18 מושבים בכל שורה
(8, 30),   -- אולם עם 8 שורות ו-30 מושבים בכל שורה
(20, 15);  -- אולם עם 20 שורות ו-15 מושבים בכל שורה


-------------------הכנסת ארועים עם הכנסה איזה אולם------------------------------
INSERT INTO Event (Name, Date, Location, Description, HoleId, NumTicket, NumTicketExist, Price)
VALUES 
('הופעה באArena', '2025-04-15 20:00:00', 'היכל ארנה, תל אביב', 'הופעה מדהימה עם ביצועים מרהיבים', 1, 5, 5, 150),
('ערב קומדיה סטנד-אפ', '2025-05-20 21:00:00', 'תיאטרון ירושלים', 'ערב של צחוק עם קומיקאים מהשורה הראשונה', 2, 10, 10, 120),
('פסטיבל רוק', '2025-06-10 18:00:00', 'אצטדיון חיפה', 'פסטיבל עם להקות רוק פופולריות', 3, 5, 5, 100),
('מחזה: המלט', '2025-07-01 19:30:00', 'תיאטרון באר שבע', 'מחזה קלאסי של שייקספיר', 4, 9, 9, 80),
('ליל ג׳אז', '2025-08-05 22:00:00', 'מועדון ג׳אז תל אביב', 'ליל ג׳אז בלתי נשכח עם מוזיקה חלקה', 5, 20, 20, 100);
------------------הכנסת מקומות ישיבה של ארוע---------------

INSERT INTO Seat (EventId, numLine, SeatNumber, IsAvailable, IsAccessible)
VALUES
(2, 1, 1, 1, 0), (2, 1, 2, 1, 0), (2, 1, 3, 1, 1), (2, 1, 3, 1, 0), (2, 1, 4, 1, 1),
(2, 2, 1, 1, 0), (2, 2, 2, 1, 0), (2, 2, 3, 1, 1), (2, 2, 4, 1, 0), (2, 2, 5, 1, 1);
